{"pages":[{"pageData":{"objectId":"500c6081-6160-4c34-8238-75d9620c8f40","pageName":"Cloud","linkName":"Cloud","linkDescription":"No matter what your long-term cloud goals are, Recro can help you meet them. Recro delivers secure, scalable solutions on top of the various commercial cloud and federal cloud offerings, including AWS, Azure, and Self hosted cloud solutions. From planning your move to automating operations, we can handle it. We keep your systems and data secure and available while optimizing deployment to minimize cost.","linkPath":"/cloud","isActive":true,"isInExpertise":true,"isInAboutUs":false,"isInInsights":false,"isInCareers":false,"isInMarkets":false,"linkNavContent":"No matter what your long-term cloud goals are, Recro can help you meet them. Recro delivers secure, scalable solutions on top of the various commercial cloud and federal cloud offerings including AWS, Azure, and Self hosted cloud solutions. From planning your move to automating operations, we can handle it. We keep your systems and data secure and available while optimizing deployment to minimize cost.","headline":"Cloud","subHeadline":"Enabling capability through the most cutting-edge Tailored solutions for every need.","content":"When you need to deliver scalable capability at a moment's notice, the cloud is there. Recro can handle every aspect of your cloud needs, from architecture to implantation automation, and management. Not only do we make it easy to reliably deliver capability, but we also secure it from threats so you can deliver with confidence. Our Services Include Migration: If you're moving into the cloud for the first time, Recro can make the transition as seamless as possible. We'll handle all the complex components and keep your data secure with the most up-to-date tools and strategies. Security: Be confident that your most sensitive information is never at risk. We'll ensure your cloud environment is secured, working to eliminate threats before they arrive. Multi-cloud deployment: We can diversify your capabilities across multiple cloud service providers and within your on-premises environment, ensuring your capabilities are always available.      Cost Savings: Implementing the cloud doesn't have to break your budget. We can set you up with cost-effective solutions that continue to pay for themselves long after installation."}},{"pageData":{"objectId":"9aa37fbc-9657-4bc1-b6eb-6313b34fa7d2","pageName":"Cyber Security","linkName":"Cyber Security","linkDescription":"Cyber Security","linkPath":"/cyber-security","isActive":true,"isInExpertise":true,"isInAboutUs":false,"isInInsights":false,"isInCareers":false,"isInMarkets":false,"linkNavContent":"Our cyber security experts are confident in guiding you to reducing your organization's operational risk. We understand federal compliance requirements, how to navigate them, and how to automate them. We implement the tools that provide your enterprise with visibility and are able to effectively leverage the vast amount of data to create information that drives your enterprise cyber security strategy.","headline":"Cyber Security","subHeadline":"Keeping most sensitive data behind closed doors Integrated and Intelligent","content":"Whether you're in a government position or the private sector, it's critical that your information remains just that: yours. We integrate cutting-edge security solutions in every aspect of your infrastructure, safeguarding your data from any and every threat. If there's ever a risk, we eliminate it right away and prevent it from happening again. Our Services Include Risk Analysis: New cyber threats pop up every day, and with our risk analysis service, you'll be safe from them all. You'll be rewarded with a more efficient organization and improved peace of mind. Cyber Defense: Become more proactive in the fight against cyber attacks with our advanced cyber defense services. We'll utilize threat-informed decision making to decide which risks to eliminate first. Cloud Security: Cyber security doesn't stop with what's on your computer. That's why our services extend to the cloud, creating a secure environment that keeps your data safe from every angle.     RMF Governance Tool: We have experience implementing/operating the leading tools supporting Governance including ServiceNow and RSA Archer. We can seamlessly migrate you from legacy tools including EMASS."}},{"pageData":{"objectId":"a408748b-0ff9-4f84-a2a7-8a3d0a7204d1","pageName":"Analytics","linkName":"Analytics","linkDescription":"Analytics","linkPath":"/analytics","isActive":true,"isInExpertise":true,"isInAboutUs":false,"isInInsights":false,"isInCareers":false,"isInMarkets":false,"linkNavContent":"We leverage passionate people along with the latest technology allowing them to capitalize on leverage BigData, Machine Learning, Artificial Intelligence, and modeling. We are able to collect relevant data and turn it into meaningful information.","headline":"Analytics","subHeadline":"Transforming your organization's data into mission driving information","content":"To use your data to your advantage, you have to pair it with passionate people and innovative technology solutions. Recro can do that and so much more. Our experts unlock your potential by discovering the most vital information through analytics and transforming them into solutions. We deliver high-quality results every single time, thanks to our expertise in the DevOps methodology. Our Services Include Modeling and Simulation: High-tech multivariate modeling and advanced statistics allow us to support all kinds of simulations, preparing you for anything. Big Data: Recro's highly skilled Analysts and Data Scientists utilize innovative, industry- leading technologies to generate meaningful insights from data (e.g. Apache Spark, Hadoop, Tensorflow, Elastic). Artificial Intelligence: Using AI and Machine Learning to your advantage can not only put you at the front of the pack, but it can learn and grow as your company does, moving you forward every single day. High Performance Computing: Solve your most complicated challenges with the benefits of High Performance Computing with the help of our experts at Recro. Cyber Security: We incorporate and key data sources (e.g."}},{"pageData":{"objectId":"d784f35f-cbdc-455e-ac68-454b7bfcb98b","pageName":"Consulting","linkName":"Consulting","linkDescription":"Consulting","linkPath":"/consulting","isActive":true,"isInExpertise":true,"isInAboutUs":false,"isInInsights":false,"isInCareers":false,"isInMarkets":false,"linkNavContent":"Our consultants create customized solutions from beginning to end. We work to understand your immediate needs and serve you today while preparing you for the bright future ahead. Recro takes a 360-degree approach to help you reach your goals.","headline":"Consulting","subHeadline":"Guiding you forward from day one. Innovation and Leadership","content":"Whether you are in the public or private sector, it's vital to stay ahead to be successful. Recro's expert consultants help you identify the trends and capitalize on them first. We work to learn about the day's most cutting-edge technologies and figure out how we can make them work for you, perfectly meeting the needs of today and the challenges of tomorrow. Our Services Include IT Modernization:  Recro engineers are experts in moving your organization's IT into the future. We work with you to assess the options and choose the best path for your organization, whether that be utilizing the commercial cloud, leveraging Kubernetes, or a combination of both.  Cyber Security: We assess your organization's gaps and weaknesses, and work with you to develop a strategy to close them, and create processes that avoid them in the future, well allowing you to still develop capabilities quickly. We are able to leverage the vast amount of data created by the cyber tools you leverage today and can transform that data into information that drives your enterprise's cyber-security strategy. Communications: We'll work with you to design tailored, data-driven campaigns that increase and drive engagement, drive engagement, improve conversions, and push toward long-term goals. Human Capital Planning: Learn how to use your team to the best of their abilities. Increase employee satisfaction and create a more efficient agency overall, from recruiting and training to ongoing education."}},{"pageData":{"objectId":"7560aa0f-d051-46c0-babd-25c7ac67b11f","pageName":"Cloud Native","linkName":"Cloud Native","linkDescription":"Cloud Native","linkPath":"/cloud-native","isActive":true,"isInExpertise":true,"isInAboutUs":false,"isInInsights":false,"isInCareers":false,"isInMarkets":false,"linkNavContent":"With Recro, you will move with confidence to a new cloud-native architecture that empowers your organization to adapt faster. Our team will quickly get you fully up and running with or without internet connectivity. We help you to mitigate risks and reap the benefits of innovation.","headline":"Cloud Native","subHeadline":"Moving you into the cutting -edge of technology th Move onward and upward.","content":"With Recro, you will move with confidence to a new cloud-native architecture that empowers your organization to adapt faster by enabling your development teams. Embracing the cloud-native paradigm is not without risks, but our team of experts will mitigate your risks by planning out and assisting in the execution of your migration or greenfield development effort. so that through our meticulous planning, we can stride confidently together into the new era of the cloud-native enterprise. Our team will get you fully up and running with or without internet connectivity and will utilize our lessons learned across countless many industries to avoid common issues and pitfalls, that resulting in a solution that is fully adapted to your needs. Our Services Include: Infrastructure/Application Architectural Planning Review o   Our experts are adept at identifying complex problems that inevitably arise and providing prescriptive guidance to remedy any issues. We follow include best practices from different categories including security, performance, configuration, and architecture into a comprehensive Go to Green Plan to enable your teams to deliver every day. Managed Deployments and Operations o   Recro will manage and watch over your platform every hour of every day, so you can fully concentrate on your core business. Cloud-Native Infrastructure/Software Engineers o   Full/Part-time resources will be integrated into your team and become invaluable to your mission. Software Engineering and DevOps Best Practices o   Recro will train and guide your team as necessary to implement and maintain industry best practices for CI/CD pipelines, microservices, and DevSecOps. Federal Authorization Process o   Our team is very experienced with implementing proper security and navigating the A&A / RMF processes to achieve ATO in a timely manner to get your cloud-native project in production."}},{"pageData":{"objectId":"a5b9555e-f658-4860-938f-af8e192ecc22","pageName":"Digital Solutions","linkName":"Digital Solutions","linkDescription":"Digital Solutions","linkPath":"/digital-solutions","isActive":true,"isInExpertise":true,"isInAboutUs":false,"isInInsights":false,"isInCareers":false,"isInMarkets":false,"linkNavContent":"We work to modernize IT through the implementation of cutting-edge processes, tools, and technology. We embrace Agile and DevSecOps methodology, through which we quickly provide security capabilities. Your success is our top priority; we craft strategies work to meet your specific needs while working within the constraints facing your organization.","headline":"Digital Solutions","subHeadline":"Bringing transformative solutions to your digital Meeting You Where You Are","content":"Getting into the potential of digital solutions, or want to improve your current situation? Recro is here. We modernize your IT solutions with advanced analytics, transformative computing, and informed decision-making. Our digital solutions bring a more effective back end to support your company along with a user-friendly interface for your visitors. Our Services Include Integration: We simplify the process of integrating and automating the various different software products you use every day, creating a streamlined experience.     Custom Development: Just as your organization is unique, so should your digital solutions be. We'll work to understand your specific needs and address them with confidence in a manner tailored just to your requests. Customer Experience: Craft the ultimate user experience with the help of our experts. We work to keep your digital presence simple and pleasant for the user, resulting in higher satisfaction and improved performance. Edge Computing: We keep you ahead of the game with innovative edge computing services. You'll have instant access to your data and can handle any task at a moment's notice. Data Management: Ensure that every worker has exactly the access they need. We keep your agency running smoothly with efficient digital ecosystems and advanced performance strategies.     System Administration: The behind the scenes of your digital space is just as important as the interface. Recro is able to keep your system updated and working smoothly at all times with our expert system administrators.  Product Expertise: Our team has ample experience with ServiceNow, Archer, Kubernetes, and various additional systems that can benefit your operation."}},{"pageData":{"objectId":"ff671cbf-e30e-41c7-afc3-f702b6e35864","pageName":"Civil Government","linkName":"Civil Government","linkDescription":"Civil Government","linkPath":"/civil-government","isActive":true,"isInExpertise":false,"isInAboutUs":false,"isInInsights":false,"isInCareers":false,"isInMarkets":true,"linkNavContent":"Serving the public is no easy job, but with Recro by your side, you'll have the resources to get it done. We work with you to tailor solutions that bring reliable capabilities to your customers and keep your community safe and secure.","headline":"Civil Government","subHeadline":"","content":"Serving the public is no easy job, but with Recro by your side, you'll have the resources to get it done. We work with you to tailor solutions that bring reliable capabilities to your customers and keep your community safe and secure."}},{"pageData":{"objectId":"62b4a815-209e-4b84-bd8c-29e2d53b2dd3","pageName":"Defense","linkName":"Defense","linkDescription":"Defense","linkPath":"/defense","isActive":true,"isInExpertise":false,"isInAboutUs":false,"isInInsights":false,"isInCareers":false,"isInMarkets":true,"linkNavContent":"We are proud to help our nation's military tackle their unique and pivotal missions by implementing cutting-edge solutions and technology, tailored to surpass the capabilities of our nation's adversary.","headline":"Defense","subHeadline":"","content":"We are proud to help our nation's military tackle their unique and pivotal missions by implementing cutting-edge solutions and technology, tailored to surpass the capabilities of our nation's adversary."}},{"pageData":{"objectId":"17d601ba-9f34-445d-84a4-812fbd21d91f","pageName":"Commercial","linkName":"Commercial","linkDescription":"Commercial","linkPath":"/commercial","isActive":true,"isInExpertise":false,"isInAboutUs":false,"isInInsights":false,"isInCareers":false,"isInMarkets":true,"linkNavContent":"Our expertise in high-security, high-pressure situations can benefit your business. We are able to meet your unique needs by bringing unmatched experience and innovative solutions to the table.","headline":"Commercial","subHeadline":"","content":"Our expertise in high-security, high-pressure situations can benefit your business. We are able to meet your unique needs by bringing unmatched experience and innovative solutions to the table."}},{"pageData":{"objectId":"f4faefaf-b74c-468d-8500-5d773ff3a924","pageName":"Intelligence","linkName":"Intelligence","linkDescription":"Intelligence","linkPath":"/intelligence","isActive":true,"isInExpertise":false,"isInAboutUs":false,"isInInsights":false,"isInCareers":false,"isInMarkets":true,"linkNavContent":"When your mission is critical, your technology can't fail. We combine innovation and talent to bring solutions where they matter most and help protect national security each and every day.","headline":"Intelligence","subHeadline":"","content":"When your mission is critical, your technology can't fail. We combine innovation and talent to bring solutions where they matter most and help protect national security each and every day."}},{"pageData":{"objectId":"3a371c25-ac25-46fb-8b1a-001445ae66c5","pageName":"About Us","linkName":"About Us","linkDescription":"About Us","linkPath":"/about-us","isActive":true,"isInExpertise":false,"isInAboutUs":true,"isInInsights":false,"isInCareers":false,"isInMarkets":false,"linkNavContent":"About Us","headline":"About Us","subHeadline":"Reinventing How We Move Forward. About Recro Corporation","content":"Recro gets its name from the Latin for re-invent, which is exactly what we aim to do. We transform our clients' operations through holistic full-stack solutions. Each client's needs are individually met, resulting in tailored solutions that work for the present and well into the future. Many of our staff hold high-level United States Government security clearances, and our experience across sectors brings you a unique advantage.   Recro leadership strongly believes in putting our people first. We focus on hiring passionate, expert, people and seek to remove barriers and enable our personnel to deliver. We are experienced in Consulting, Analytics, Digital Solutions, Software Development, Cloud, Cloud-Native, and Cyber Security."}},{"pageData":{"objectId":"81559b56-68a9-426f-9381-0252f311952e","pageName":"Careers","linkName":"Careers","linkDescription":"Careers","linkPath":"/careers","isActive":true,"isInExpertise":false,"isInAboutUs":false,"isInInsights":false,"isInCareers":true,"isInMarkets":false,"linkNavContent":"We are building a culture at Recro where amazing people (like you) can do their best work. If you are ready to grow your career and Recro (re-invent) the way our clients operate, you have come to the right place.","headline":"Careers","subHeadline":"Careers","content":"Careers"}}]}